## Archive Exploration

**Description:**

**Citation:**

**Date of Access**:

**Link**:

![CC-ZeroFlickr images reviewed by FlickreviewRPhotos uploaded from Flickr by FÃ¦ using a scriptPhotographs by Alan Schmierer](https://upload.wikimedia.org/wikipedia/commons/thumb/8/8a/SNOWSHOE_HARE_%28Lepus_americanus%29_%285-28-2015%29_quoddy_head%2C_washington_co%2C_maine_-01_%2818988734889%29.jpg/1452px-SNOWSHOE_HARE_%28Lepus_americanus%29_%285-28-2015%29_quoddy_head%2C_washington_co%2C_maine_-01_%2818988734889%29.jpg?20170313021652)

# 3. Data loading and preliminary exploration

In [2]:
import pandas as pd
URL = 'https://pasta.lternet.edu/package/data/eml/knb-lter-bnz/55/22/f01f5d71be949b8c700b6ecd1c42c701'
hares = pd.read_csv(URL)

In [3]:
hares.head()

,date,time,grid,trap,l_ear,r_ear,sex,age,weight,hindft,notes,b_key,session_id,study
0,11/26/1998,NaN,bonrip,1A,414D096A08,NaN,NaN,NaN,1370.0,160.0,NaN,917.0,51,Population
1,11/26/1998,NaN,bonrip,2C,414D320671,NaN,M,NaN,1430.0,NaN,NaN,936.0,51,Population
2,11/26/1998,NaN,bonrip,2D,414D103E3A,NaN,M,NaN,1430.0,NaN,NaN,921.0,51,Population
3,11/26/1998,NaN,bonrip,2E,414D262D43,NaN,NaN,NaN,1490.0,135.0,NaN,931.0,51,Population
4,11/26/1998,NaN,bonrip,3B,414D2B4B58,NaN,NaN,NaN,1710.0,150.0,NaN,933.0,51,Population

In [4]:
# Finding dimensions of data frame
hares.shape

(3380, 14)

In [5]:
# Data types within data frame
hares.dtypes

date           object
time           object
grid           object
trap           object
l_ear          object
r_ear          object
sex            object
age            object
weight        float64
hindft        float64
notes          object
b_key         float64
session_id      int64
study          object
dtype: object

In [7]:
# Any columns with a significant number of NA values?
hares.isna().sum()

date             0
time          3116
grid             0
trap            12
l_ear           48
r_ear          169
sex            352
age           2111
weight         535
hindft        1747
notes         3137
b_key           47
session_id       0
study          163
dtype: int64

In [13]:
# Min and max of weight and feet measurements
hares[['weight','hindft']].describe()

            weight       hindft
count  2845.000000  1633.000000
mean   1346.081547   130.872627
std     345.160112    16.155295
min       0.000000    60.000000
25%    1180.000000   128.000000
50%    1400.000000   135.000000
75%    1580.000000   140.000000
max    2365.000000   160.000000

In [17]:
# Explore unique values
hares['sex'].unique()

array([nan, 'M', 'F', '?', 'F?', 'M?', 'pf', 'm', 'f', 'f?', 'm?', 'f ',
       'm '], dtype=object)

In [25]:
# Exploratory question: what kind of studies?
hares['study'].unique()

hares_pop = hares[hares['study'] == 'Population']

In [29]:
hares_pop_mean_weight = hares_pop.groupby('trap').mean('weight').sort_values('weight', ascending = False)
hares_pop_mean_weight

           weight      hindft       b_key  session_id
trap
7f    1640.000000         NaN  734.250000   35.750000
5c    1540.000000         NaN   63.000000   64.000000
7D    1535.000000  125.500000  388.777778   64.833333
4f    1534.166667  142.000000  487.125000   38.375000
9C    1525.000000  131.777778  433.400000   69.866667
...           ...         ...         ...         ...
4e     565.000000   90.000000   72.000000   50.000000
6b     450.000000   96.000000   76.000000   50.000000
4c     427.500000   87.500000   68.500000   50.000000
3g            NaN         NaN  975.000000   37.000000
4b            NaN         NaN   63.000000   64.000000

[121 rows x 4 columns]

# 4. Detecting messy values

| Value     | Definition |
| ----------- | ----------- |
| m      | male      |
| m?     | male not confirmed        |
| f    | female      |
| f?     | female not confirmed        |

In [34]:
# number of times each sex value appears
hares['sex'].str.lower().str.strip().value_counts().drop(['?', 'pf'])

# value_counts defaults to dropping NA values, can change with an argument

# .str.strip() removes whitespace whichw as causing duplicate values
# .str.lower() also removed multiple values caused by capitalization

sex
f     1721
m     1249
f?      13
m?       4
Name: count, dtype: int64

# 5. Brainstorm

## Values in 'sex' column as only "male" and "female"?

1. Use similar cleaning to what we did in part 4 to do basic cleaning
2. Create a dictionary that defines both f and f? as "female", and the same for male equivalent
3. Filter our hares data frame using our dictionary

In [35]:
sex_mapping = {
    ("m", "m?") : "male", 
    ("f", "f?") : "female"}

In [37]:
# hares['sex'].replace(sex_mapping)
# doesn't work :(

In [38]:
import numpy as np

# 6. Clean values